jimmywong2003/nrf52-ble-central-scanner-with-whitelist/sdk_mod/ble_services/ble_image_transfer_service/ble_image_transfer_service.c
/**
 * Copyright (c) 2012 - 2017, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include <stdio.h>
#include "sdk_common.h"
#if NRF_MODULE_ENABLED(BLE_ITS)
#include "ble_image_transfer_service.h"
#include "ble_srv_common.h"
#include "ble.h"
#include "nrf_gpio.h"

#define NRF_LOG_MODULE_NAME ble_image_transfer_service
#if BLE_ITS_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL BLE_ITS_CONFIG_LOG_LEVEL
#define NRF_LOG_INFO_COLOR BLE_ITS_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR BLE_ITS_CONFIG_DEBUG_COLOR
#else // BLE_ITS_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 3
#endif // BLE_ITS_CONFIG_LOG_ENABLED
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

#define BLE_UUID_ITS_SERVICE     0x0001
#define BLE_UUID_ITS_TX_CHARACTERISTIC 0x0003 /**< The UUID of the TX Characteristic. */
#define BLE_UUID_ITS_RX_CHARACTERISTIC 0x0002 /**< The UUID of the RX Characteristic. */
#define BLE_UUID_ITS_IMG_INFO_CHARACTERISTIC 0x0004 /**< The UUID of the TX Command Characteristic. */
#define BLE_UUID_ITS_RX_DATA_CHARACTERISTIC 0x0005 /** < The UUID of the RX Command Characteristic. */

#define BLE_ITS_MAX_RX_CHAR_LEN BLE_ITS_MAX_DATA_LEN /**< Maximum length of the RX Characteristic (in bytes). */
#define BLE_ITS_MAX_TX_CHAR_LEN BLE_ITS_MAX_DATA_LEN /**< Maximum length of the TX Characteristic (in bytes). */

#define ITS_BASE_UUID                                                                                                  \
        {                                                                                                              \
                {                                                                                                      \
                        0x3E, 0xCA, 0xDC, 0x24, 0x0E, 0xE5, 0xA9, 0xE0, 0x93, 0xF3, 0xA3, 0xB5, 0x00, 0x00, 0x40, 0x6E \
                }                                                                                                      \
        } /**< Used vendor specific UUID. */



volatile uint32_t file_size = 0, file_pos = 0, m_max_data_length = 20;
uint8_t *file_data;
ble_its_t *m_its;

static uint32_t count = 0;

// static ble_its_img_info_t m_image_info;
static uint32_t m_image_send_byte = 0;

// static ble_its_cmd_data_t m_its_tx_cmd_data;

/**@brief Function for handling the @ref BLE_GAP_EVT_CONNECTED event from the S110 SoftDevice.
 *
 * @param[in] p_its     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_connect(ble_its_t *p_its, ble_evt_t const *p_ble_evt)
{
        p_its->conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

        ble_its_evt_t its_evt;
        its_evt.evt_type = BLE_ITS_EVT_CONNECTED;
        p_its->evt_handler(p_its, &its_evt);
}

/**@brief Function for handling the @ref BLE_GAP_EVT_DISCONNECTED event from the S110 SoftDevice.
 *
 * @param[in] p_its     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_disconnect(ble_its_t *p_its, ble_evt_t const *p_ble_evt)
{
        UNUSED_PARAMETER(p_ble_evt);
        ble_its_evt_t its_evt;
        its_evt.evt_type = BLE_ITS_EVT_DISCONNECTED;
        p_its->evt_handler(p_its, &its_evt);
        p_its->conn_handle = BLE_CONN_HANDLE_INVALID;
}

/**@brief Function for handling the @ref BLE_GATTS_EVT_WRITE event from the S110 SoftDevice.
 *
 * @param[in] p_its     Nordic UART Service structure.
 * @param[in] p_ble_evt Pointer to the event received from BLE stack.
 */
static void on_write(ble_its_t *p_its, ble_evt_t const *p_ble_evt)
{
        ble_gatts_evt_write_t const *p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

        if (
                (p_evt_write->handle == p_its->tx_handles.cccd_handle) &&
                (p_evt_write->len == 2))
        {
                if (ble_srv_is_notification_enabled(p_evt_write->data))
                {
                        p_its->is_notification_enabled = true;
                        NRF_LOG_INFO("Enable the TX Notification");
                        ble_its_evt_t its_evt;
                        its_evt.evt_type = BLE_ITS_EVT_ITS_TX_DATA_READY_EVT;
                        its_evt.p_data = p_evt_write->data;
                        its_evt.data_len = p_evt_write->len;
                        p_its->evt_handler(p_its, &its_evt);
                }
                else
                {
                        p_its->is_notification_enabled = false;
                }
        }
        else if (
                (p_evt_write->handle == p_its->img_info_handles.cccd_handle) &&
                (p_evt_write->len == 2))
        {
                if (ble_srv_is_notification_enabled(p_evt_write->data))
                {
                        p_its->is_info_char_notification_enabled = true;
                        NRF_LOG_INFO("Enable the IMG Info Notification");
                        ble_its_evt_t its_evt;
                        its_evt.evt_type = BLE_ITS_EVT_ITS_TX_INFO_READY_EVT;
                        its_evt.p_data = p_evt_write->data;
                        its_evt.data_len = p_evt_write->len;
                        p_its->evt_handler(p_its, &its_evt);
                }
                else
                {
                        p_its->is_info_char_notification_enabled = false;
                }
        }
        else if (
                (p_evt_write->handle == p_its->rx_handles.value_handle) &&
                (p_its->evt_handler != NULL))
        {
                ble_its_evt_t its_evt;
                its_evt.evt_type = BLE_ITS_EVT_ITS_RX_CMD_EVT;
                its_evt.p_data = p_evt_write->data;
                its_evt.data_len = p_evt_write->len;
                p_its->evt_handler(p_its, &its_evt);
        }
        else if (
                (p_evt_write->handle == p_its->rx_data_handles.value_handle) &&
                (p_its->evt_handler != NULL))
        {
                ble_its_evt_t its_evt;
                its_evt.evt_type = BLE_ITS_EVT_ITS_RX_DATA_EVT;
                NRF_LOG_INFO("BLE_ITS_EVT_ITS_RX_DATA_EVT len = %d", p_evt_write->len);
                its_evt.p_data = p_evt_write->data;
                its_evt.data_len = p_evt_write->len;
                p_its->evt_handler(p_its, &its_evt);
        }
        else
        {
                // Do Nothing. This event is not relevant for this service.
        }
}

/**@brief Function for adding TX characteristic.
 *
 * @param[in] p_its       Nordic UART Service structure.
 * @param[in] p_its_init  Information needed to initialize the service.
 *
 * @return NRF_SUCCESS on success, otherwise an error code.
 */
static uint32_t tx_char_add(ble_its_t *p_its, const ble_its_init_t *p_its_init)
{
        /**@snippet [Adding proprietary characteristic to S110 SoftDevice] */
        ble_gatts_char_md_t char_md;
        ble_gatts_attr_md_t cccd_md;
        ble_gatts_attr_t attr_char_value;
        ble_uuid_t ble_uuid;
        ble_gatts_attr_md_t attr_md;

        memset(&cccd_md, 0, sizeof(cccd_md));

